app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "みーくんまるまる"], ["text", "お風呂でズサァ"], ["created_at", "2019-04-30 12:53:16.199801"], ["updated_at", "2019-04-30 12:53:16.199801"]]
---
    def create
        @post = Post.new(post_params)

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "お風呂でズサァ\r\nなしバーカリカリ"], ["updated_at", "2019-04-30 12:53:49.986775"], ["id", 3]]
---
    def update
        @post = Post.find(params[:id])

        if @post.update(post_params)